<a href="https://colab.research.google.com/github/kellianneyang/bootcamp-assignments/blob/main/Pandas_Exercises_on_the_Titanic_Dataset_(Core).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Name:** Kellianne Yang

**Assignment:** Pandas Exercises on the Titanic Dataset (Core)

---

In [ ]:
# mount data
from google.colab import drive
drive.mount('/content/drive')

# import libraries
import pandas as pd

# load the dataset
filename = '/content/titanic.csv'
df = pd.read_csv(filename)

Mounted at /content/drive

1. Display the head of the dataframe.

In [ ]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

2. What is the percentage of people who survived? (hint: find the mean of the survival column).

In [ ]:
# find mean of survival column
survived = df['Survived'].mean()

In [ ]:
# convert to percent and round
survived = round((survived * 100), 2)

In [ ]:
# print summary description
print(f"About {survived}% of people survived.")

About 38.38% of people survived.

3. How many of each sex survived?

In [ ]:
# make a filtered df for survivors
survived_filter = df['Survived'] == 1

In [ ]:
# apply it to the df
survived_df = df[survived_filter]

In [ ]:
# use groupby and count to see number of survivors for males and females
survivors_by_sex = survived_df.groupby('Sex')['Survived'].count()

In [ ]:
# save to variables
female_survived  = survivors_by_sex[0]
male_survived = survivors_by_sex[1]

In [ ]:
print(f"{male_survived} males survived and {female_survived} females survived.")

109 males survived and 233 females survived.

4. Considering only the group of passengers who paid less than $10, what percentage of this group survived? Hint: You can filter the dataframe based on the fare, and then use value_counts(normalize = True) on the "Survived" column to obtain proportions instead of sums. For example 0.25 would indicate 25%

In [ ]:
# filter df based on fare
fare_filter = df['Fare'] < 10

In [ ]:
# apply filter to df
fare_filtered_df = df[fare_filter]

In [ ]:
# get value_counts() on 'Survived'
# use value_counts(normalize = True) to get proportion instead of sum
fare_survived = fare_filtered_df['Survived'].value_counts(normalize = True)
fare_survived

0    0.800595
1    0.199405
Name: Survived, dtype: float64

In [ ]:
# save proportions to variables
poor_didnt_survive = fare_survived[0]
poor_survived = fare_survived[1]

In [ ]:
# print summary description
print(f"About {round((poor_didnt_survive * 100), 2)}% of people who paid less than \
$10 for their ticket died, and {round((poor_survived * 100), 2)}% survived.")

About 80.06% of people who paid less than $10 for their ticket died, and 19.94% survived.

5. Overall, what is the average age of those who didn't survive?

In [ ]:
# make a filter for just non-survivors
didnt_survive_filter = df['Survived'] == 0

In [ ]:
# apply filter to df
didnt_survive_filtered_df = df[didnt_survive_filter]

In [ ]:
# get mean of 'Age' for didnt_survive_filtered_df
mean = didnt_survive_filtered_df['Age'].mean()

In [ ]:
# print summary description
print(f"The average age of those who didn't survive was about {round(mean, 2)} years.")

The average age of those who didn't survive was about 30.63 years.

6. Overall, what is the average age of those who did survive?

In [ ]:
# negate the filter we created for those who didn't survive to get only
# those who did survive
~didnt_survive_filter

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [ ]:
# apply filter to df
survived_filtered_df = df[~didnt_survive_filter]
survived_filtered_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [ ]:
# get mean of 'Age' for survived_filtered_df
mean = survived_filtered_df['Age'].mean()
mean

28.343689655172415

In [ ]:
# print summary description
print(f"The average age of those who survived was about {round(mean, 2)} years.")

The average age of those who survived was about 28.34 years.

7. What is the average age of those who did and didn't survive grouped by Sex?

In [ ]:
# take survived_filtered_df, group by 'Sex', and determine average age
survived_grouped_by_sex_df = survived_filtered_df.groupby('Sex')['Age'].mean()
survived_grouped_by_sex_df

Sex
female    28.847716
male      27.276022
Name: Age, dtype: float64

In [ ]:
# assign to variables
female_age_survived = survived_grouped_by_sex_df['female']
male_age_survived = survived_grouped_by_sex_df['male']

In [ ]:
# print summary description
print(f"The average age of females who survived was about {round(female_age_survived, 2)} \
years and the average age of males who survived was about {round(male_age_survived, 2)} years.")

The average age of females who survived was about 28.85 years and the average age of males who survived was about 27.28 years.

In [ ]:
# take didnt_survive_filtered_df, group by 'Sex', and determine average age
didnt_survive_grouped_by_sex_df = didnt_survive_filtered_df.groupby('Sex')['Age'].mean()
didnt_survive_grouped_by_sex_df

Sex
female    25.046875
male      31.618056
Name: Age, dtype: float64

In [ ]:
# assign to variables
female_age_didnt_survive = didnt_survive_grouped_by_sex_df['female']
male_age_didnt_survive = didnt_survive_grouped_by_sex_df['male']

In [ ]:
# print summary description
print(f"The average age of females who didn't survive was about {round(female_age_didnt_survive, 2)} \
years and the average age of males who didn't survive was about {round(male_age_didnt_survive, 2)} years.")

The average age of females who didn't survive was about 25.05 years and the average age of males who didn't survive was about 31.62 years.